{
  "categories": {
    "wouldYouRather": {
      "name": "Would You Rather",
      "emoji": "🤔",
      "questions": [
        "Would you rather be able to fly or be invisible?",
        "Would you rather live in a treehouse or a castle?",
        "Would you rather have super strength or super speed?",
        "Would you rather be able to talk to animals or speak every human language?",
        "Would you rather have a pet dragon or a pet unicorn?",
        "Would you rather always be 10 minutes late or 20 minutes early?",
        "Would you rather have no homework forever or no chores forever?",
        "Would you rather live in a world with no internet or no cars?",
        "Would you rather eat only pizza for a year or only ice cream for a year?",
        "Would you rather be the funniest person in the room or the smartest?",
        "Would you rather be able to breathe underwater or fly through the sky?",
        "Would you rather have a pause button for your life or a rewind button?",
        "Would you rather always win board games or always win video games?",
        "Would you rather have a personal chef or a personal chauffeur?",
        "Would you rather live in a world where it's always summer or always winter?",
        "Would you rather be famous but always busy or unknown but free?",
        "Would you rather have the ability to read minds or predict the future?",
        "Would you rather explore outer space or the deepest ocean?",
        "Would you rather have more time or more money?",
        "Would you rather have one wish granted today or three wishes in 10 years?",
        "Would you rather be really good at one thing or pretty good at everything?",
        "Would you rather meet your favorite celebrity or be on TV?",
        "Would you rather have a magic carpet or a time machine?",
        "Would you rather eat a live bug or lick a stranger's foot?",
        "Would you rather have fingers as long as your legs or legs as long as your fingers?",
        "Would you rather always have to skip everywhere or always have to walk backwards?",
        "Would you rather have no eyebrows or only one eyebrow?",
        "Would you rather sweat maple syrup or sneeze glitter?",
        "Would you rather have to sing everything you say or dance everywhere you go?",
        "Would you rather only be able to whisper or only be able to shout?"
      ]
    },
    "superpowers": {
      "name": "Superpowers & Magic",
      "emoji": "⚡",
      "questions": [
        "If you could have any superpower, what would it be?",
        "If you could be a superhero, what would your name be?",
        "If you were a wizard, what spell would you cast first?",
        "If you could make one magic potion, what would it do?",
        "If you could have one item from a superhero, what would you choose?",
        "If you had a magic wand, what would you make appear right now?",
        "If you could become invisible, what's the first thing you'd do?",
        "If you could teleport anywhere right now, where would you go?",
        "If you could freeze time, what would you do?",
        "If you could shrink to the size of an ant, what adventure would you have?",
        "If you could grow to be 50 feet tall, what would you do first?",
        "If you could have X-ray vision, how would you use it?",
        "If you could control the weather, what would you create?",
        "If you could breathe underwater, where would you explore?",
        "If you could talk to plants, what would you ask them?",
        "If you had a magic doorway to anywhere, where would it lead?",
        "If you could turn into any animal, which would you pick?",
        "If you could have any fictional object, what would it be?",
        "If you could make one thing from a movie real, what would it be?",
        "If you could have a sidekick, who or what would it be?",
        "If you discovered you had powers, would you tell anyone?",
        "If you could give everyone in the world one power, what would it be?",
        "If you could have any superpower but only for one hour a day, what would you choose?",
        "If you found a genie, what would your three wishes be?",
        "If you could bring any cartoon character to life, who would it be?"
      ]
    },
    "favorites": {
      "name": "Favorites & Preferences",
      "emoji": "⭐",
      "questions": [
        "What is your favorite movie of all time?",
        "What is your favorite ice cream flavor?",
        "What is your favorite color and why?",
        "What is your favorite season and why?",
        "What is your favorite holiday?",
        "What is your favorite song right now?",
        "What is your favorite board game?",
        "What is your favorite sport to play or watch?",
        "What is your favorite cartoon or TV show?",
        "What is your favorite candy?",
        "What is your favorite fruit?",
        "What is your favorite video game?",
        "What is your favorite thing to do on weekends?",
        "What is your favorite animal?",
        "What is your favorite book?",
        "What is your favorite place you've ever been?",
        "What is your favorite thing about yourself?",
        "What is your favorite family tradition?",
        "What is your favorite pizza topping?",
        "What is your favorite thing to do with friends?",
        "What is your favorite dessert?",
        "What is your favorite subject in school?",
        "What is your favorite outdoor activity?",
        "What is your favorite breakfast food?",
        "What is your favorite memory from the past year?",
        "What is your favorite thing about our family?",
        "What is your favorite type of weather?",
        "What is your favorite restaurant?",
        "What is your favorite smell?",
        "What is your favorite sound?"
      ]
    },
    "imagination": {
      "name": "Imagination & Dreams",
      "emoji": "🌈",
      "questions": [
        "If you could go anywhere in the world, where would you go?",
        "If you could live in any time period, when would it be?",
        "If you could have dinner with anyone, who would it be?",
        "If you could be any fictional character, who would you be?",
        "If you could build your dream house, what would it look like?",
        "If you could invent something, what would it be?",
        "If you could have any job when you grow up, what would it be?",
        "If you could meet any historical figure, who would it be?",
        "If you could create a new holiday, what would it celebrate?",
        "If you could design a theme park, what would the rides be?",
        "If you could make up a new sport, what would the rules be?",
        "If you could live in any movie or book world, which would you choose?",
        "If you could have a zoo with any three animals, which would you pick?",
        "If you could create a new ice cream flavor, what would it be?",
        "If you could name a new planet, what would you call it?",
        "If you could design your own school, what would it be like?",
        "If you could have any animal as a best friend, which would it be?",
        "If you could be invisible for a day, what would you do?",
        "If you could go to space, would you? Why or why not?",
        "If you discovered a new island, what would you call it?",
        "If you could eat only one food forever, what would it be?",
        "If you could pick a new name for yourself, what would it be?",
        "If you could learn any skill instantly, what would it be?",
        "If you could live in any country, where would you live?",
        "If you could redesign your bedroom, what would you change?"
      ]
    },
    "funnyScenarios": {
      "name": "Funny Scenarios",
      "emoji": "😂",
      "questions": [
        "What is the grossest thing you've ever eaten?",
        "What is the most embarrassing thing that's ever happened to you?",
        "What is the silliest thing you're afraid of?",
        "What is the weirdest dream you've ever had?",
        "What is the funniest joke you know?",
        "What is the strangest food combination you actually like?",
        "If you were a food, what would you be?",
        "If you woke up as an animal tomorrow, what would you want to be?",
        "If your pet could talk, what would it say about you?",
        "What would be the worst thing to find in your cereal?",
        "If you could prank anyone without getting in trouble, what would you do?",
        "If you had to wear one outfit for a whole year, what would it be?",
        "If you had a theme song that played when you walked, what would it be?",
        "If aliens came to Earth, what would you show them first?",
        "If you could only say one word for the rest of today, what would it be?",
        "What is the most disgusting thing you can imagine eating?",
        "If you had to give up bathing or brushing teeth, which would you give up?",
        "What is the weirdest thing you've ever seen someone do?",
        "If you had to live without your phone or without dessert, which would you choose?",
        "What is the most ridiculous outfit you'd be willing to wear in public?",
        "If you were a vegetable, which one would you be?",
        "What animal noise could you make for an entire day?",
        "If you had to eat the same breakfast every day, what would it be?",
        "What is the silliest face you can make?",
        "If your life had a laugh track, when would it play the most?"
      ]
    },
    "deepThoughts": {
      "name": "Deep Thoughts",
      "emoji": "💭",
      "questions": [
        "What makes you feel most grateful?",
        "What is something you wish everyone understood about you?",
        "What is one thing that always makes you smile?",
        "Who is someone you admire and why?",
        "What is a challenge you've overcome that you're proud of?",
        "What is something you're really good at?",
        "What is something you want to get better at?",
        "What does being a good friend mean to you?",
        "What is the best advice you've ever received?",
        "What makes our family special?",
        "What is something that made you happy this week?",
        "What is something you've learned recently that surprised you?",
        "If you could change one thing about the world, what would it be?",
        "What is a goal you're working toward?",
        "What is something that scares you but you want to try anyway?",
        "What do you think makes a person truly successful?",
        "What are three words that describe you?",
        "What is a kind thing someone did for you recently?",
        "What do you love most about where we live?",
        "What is something you're looking forward to?",
        "What is the most important lesson you've learned in life?",
        "Who has taught you the most and what did they teach you?",
        "What makes you feel calm and peaceful?",
        "What is something you could teach someone else?",
        "What does happiness mean to you?"
      ]
    },
    "pastAndFuture": {
      "name": "Past & Future",
      "emoji": "⏳",
      "questions": [
        "What is the best day you can remember?",
        "What is your earliest memory?",
        "What do you want to be when you grow up?",
        "Where do you see yourself in 10 years?",
        "What is a memory that always makes you laugh?",
        "What is the best gift you've ever received?",
        "What was the scariest thing you've ever done?",
        "What was the most fun trip you've ever taken?",
        "What is something you used to be afraid of but aren't anymore?",
        "If you could relive one day, which would it be?",
        "What is a tradition you want to continue when you're older?",
        "What do you think life will be like in 50 years?",
        "What was your favorite age so far and why?",
        "What was the best movie you saw this year?",
        "What is the nicest thing anyone has ever done for you?",
        "What was your first pet?",
        "What was the best birthday you've ever had?",
        "What is something you've accomplished that you're proud of?",
        "What will you remember most about this year?",
        "What is something you wish you could experience again for the first time?",
        "What was the funniest thing that happened to you this month?",
        "What do you think you'll be like as a grandparent?",
        "What is a goal you have for next year?",
        "What is the bravest thing you've ever done?",
        "What is a lesson you wish you'd learned earlier?"
      ]
    },
    "thisOrThat": {
      "name": "This or That",
      "emoji": "⚖️",
      "questions": [
        "Cats or dogs?",
        "Summer or winter?",
        "Pizza or tacos?",
        "Morning person or night owl?",
        "Beach or mountains?",
        "Ice cream or cake?",
        "Books or movies?",
        "Sweet or salty?",
        "Indoor or outdoor?",
        "Texting or phone calls?",
        "City or countryside?",
        "Hot weather or cold weather?",
        "Pancakes or waffles?",
        "Early or late?",
        "Chocolate or vanilla?",
        "Loud or quiet?",
        "Bath or shower?",
        "Coffee or tea?",
        "Sunrise or sunset?",
        "Comedy or action?",
        "Halloween or Christmas?",
        "Swimming or hiking?",
        "Plane or car?",
        "Cake or pie?",
        "Reading or watching TV?"
      ]
    }
  }
}
