[
  { "q": "What has to be broken before you can use it?", "a": "An egg" },
  { "q": "I'm tall when I'm young, and I'm short when I'm old. What am I?", "a": "A candle" },
  { "q": "What month of the year has 28 days?", "a": "All of them" },
  { "q": "What is full of holes but still holds water?", "a": "A sponge" },
  { "q": "What question can you never answer yes to?", "a": "Are you asleep yet?" },
  { "q": "What gets wet while drying?", "a": "A towel" },
  { "q": "What can you keep after giving to someone?", "a": "Your word" },
  { "q": "I have branches, but no fruit, trunk or leaves. What am I?", "a": "A bank" },
  { "q": "The more of this there is, the less you see. What is it?", "a": "Darkness" },
  { "q": "What has many keys but can't open a single lock?", "a": "A piano" },
  { "q": "Where does today come before yesterday?", "a": "The dictionary" },
  { "q": "What has a head and a tail but no body?", "a": "A coin" },
  { "q": "What has a neck but no head?", "a": "A bottle" },
  { "q": "What goes up but never comes down?", "a": "Your age" },
  { "q": "What belongs to you, but other people use it more than you?", "a": "Your name" },
  { "q": "What has hands but cannot clap?", "a": "A clock" },
  { "q": "What has legs but cannot walk?", "a": "A table" },
  { "q": "What has one eye but cannot see?", "a": "A needle" },
  { "q": "What can travel around the world while staying in a corner?", "a": "A stamp" },
  { "q": "What begins with T, ends with T, and has T in it?", "a": "A teapot" },
  { "q": "What kind of room has no doors or windows?", "a": "A mushroom" },
  { "q": "What comes once in a minute, twice in a moment, but never in a thousand years?", "a": "The letter M" },
  { "q": "Which letter of the alphabet has the most water?", "a": "The C (sea)" },
  { "q": "What starts with a P, ends with an E, and has thousands of letters?", "a": "The post office" },
  { "q": "What begins with an E but only has one letter?", "a": "An envelope" },
  { "q": "I am an odd number. Take away a letter and I become even. What number am I?", "a": "Seven" },
  { "q": "If you drop me I'm sure to crack, but give me a smile and I'll always smile back. What am I?", "a": "A mirror" },
  { "q": "The more you take, the more you leave behind. What are they?", "a": "Footsteps" },
  { "q": "What turns everything around but does not move?", "a": "A mirror" },
  { "q": "What can you catch but not throw?", "a": "A cold" },
  { "q": "What has teeth but cannot bite?", "a": "A comb" },
  { "q": "What has words but never speaks?", "a": "A book" },
  { "q": "What runs but never walks, has a mouth but never talks?", "a": "A river" },
  { "q": "What can fill a room but takes up no space?", "a": "Light" },
  { "q": "What has four wheels and flies?", "a": "A garbage truck" },
  { "q": "What gets bigger the more you take away?", "a": "A hole" },
  { "q": "What comes down but never goes up?", "a": "Rain" },
  { "q": "What has a bottom at the top?", "a": "Your legs" },
  { "q": "What can run but never walks, has a bed but never sleeps?", "a": "A river" },
  { "q": "What has an eye but cannot see?", "a": "A hurricane" },
  { "q": "What has cities but no houses, forests but no trees, and water but no fish?", "a": "A map" },
  { "q": "I have no life, but I can die. What am I?", "a": "A battery" },
  { "q": "What can you hold in your right hand but never in your left?", "a": "Your left hand" },
  { "q": "What gets sharper the more you use it?", "a": "Your brain" },
  { "q": "What has ears but cannot hear?", "a": "A cornfield" },
  { "q": "I'm not alive, but I grow; I don't have lungs, but I need air. What am I?", "a": "Fire" },
  { "q": "What invention lets you look right through a wall?", "a": "A window" },
  { "q": "What can be cracked, made, told, and played?", "a": "A joke" },
  { "q": "What has a ring but no finger?", "a": "A telephone" },
  { "q": "I shave every day, but my beard stays the same. Who am I?", "a": "A barber" },
  { "q": "What two things can you never eat for breakfast?", "a": "Lunch and dinner" },
  { "q": "What word in the English language does the following: the first two letters signify a male, the first three letters signify a female, the first four letters signify a great, while the entire word signifies a great woman?", "a": "Heroine" },
  { "q": "What disappears as soon as you say its name?", "a": "Silence" },
  { "q": "You see me once in June, twice in November, and not at all in May. What am I?", "a": "The letter E" },
  { "q": "A girl fell off a 30-foot ladder but didn't get hurt. Why?", "a": "She fell off the bottom step" },
  { "q": "What word is spelled wrong in every dictionary?", "a": "Wrong" },
  { "q": "What five-letter word becomes shorter when you add two letters to it?", "a": "Short" },
  { "q": "How many letters are in the alphabet?", "a": "Eleven (T-H-E A-L-P-H-A-B-E-T)" },
  { "q": "What has 13 hearts but no other organs?", "a": "A deck of cards" },
  { "q": "What building has the most stories?", "a": "A library" },
  { "q": "What can you break even if you never pick it up or touch it?", "a": "A promise" },
  { "q": "A man who was outside in the rain without an umbrella or hat didn't get a single hair on his head wet. Why?", "a": "He was bald" },
  { "q": "What is seen in the middle of March and April that can't be seen at the beginning or end of either month?", "a": "The letter R" },
  { "q": "What goes through cities and fields, but never moves?", "a": "A road" },
  { "q": "I am always hungry and will die if not fed, but whatever I touch will soon turn red. What am I?", "a": "Fire" },
  { "q": "What can you hold in your left hand but not in your right?", "a": "Your right elbow" },
  { "q": "What is 3/7 chicken, 2/3 cat, and 2/4 goat?", "a": "Chicago" },
  { "q": "What is cut on a table, but is never eaten?", "a": "A deck of cards" },
  { "q": "What word contains 26 letters but only has three syllables?", "a": "Alphabet" },
  { "q": "Where do you find roads without cars, forests without trees, and cities without houses?", "a": "On a map" },
  { "q": "I am not alive, but I grow. I don't have lungs, but I need air. I don't have a mouth, but water kills me. What am I?", "a": "Fire" },
  { "q": "What is harder to catch the faster you run?", "a": "Your breath" },
  { "q": "What word starts with E and ends with E but only has one letter in it?", "a": "Envelope" },
  { "q": "What is so fragile that saying its name breaks it?", "a": "Silence" },
  { "q": "What is always in front of you but can't be seen?", "a": "The future" },
  { "q": "What kind of coat is best put on wet?", "a": "A coat of paint" },
  { "q": "If you have me, you want to share me. If you share me, you don't have me. What am I?", "a": "A secret" },
  { "q": "What tastes better than it smells?", "a": "Your tongue" },
  { "q": "What has a thumb and four fingers but is not alive?", "a": "A glove" },
  { "q": "The person who makes it sells it. The person who buys it never uses it. The person who uses it never knows they're using it. What is it?", "a": "A coffin" },
  { "q": "What can you put in a bucket to make it weigh less?", "a": "A hole" },
  { "q": "What do you throw out when you want to use it but take in when you don't want to use it?", "a": "An anchor" },
  { "q": "What bow can't be tied?", "a": "A rainbow" },
  { "q": "What type of cheese is made backward?", "a": "Edam" },
  { "q": "A bus driver goes the wrong way on a one-way street. He passes the cops, but they don't stop him. Why?", "a": "He was walking" },
  { "q": "What has one head, one foot, and four legs?", "a": "A bed" },
  { "q": "What can you serve but never eat?", "a": "A volleyball (or tennis ball)" },
  { "q": "What can't talk but will reply when spoken to?", "a": "An echo" },
  { "q": "What has a face and two hands but no arms or legs?", "a": "A clock" },
  { "q": "What always goes to bed with its shoes on?", "a": "A horse" },
  { "q": "What do you buy to eat but never consume?", "a": "Plates and utensils" },
  { "q": "What flies without wings?", "a": "Time" },
  { "q": "What side of a cat has the most fur?", "a": "The outside" },
  { "q": "What do you call a bear with no teeth?", "a": "A gummy bear" },
  { "q": "What has a spine but no bones?", "a": "A book" },
  { "q": "What is orange and sounds like a parrot?", "a": "A carrot" },
  { "q": "What do you call a fish without eyes?", "a": "A fsh" },
  { "q": "What stays where it is when it goes off?", "a": "An alarm clock" },
  { "q": "What kind of tree can you carry in your hand?", "a": "A palm" },
  { "q": "David's father has three sons: Snap, Crackle, and ___?", "a": "David" },
  { "q": "What do you call a dinosaur that crashes their car?", "a": "Tyrannosaurus Wrecks" },
  { "q": "What goes around the world but stays in a corner?", "a": "A stamp" },
  { "q": "What is black and white and read all over?", "a": "A newspaper" },
  { "q": "What loses its head in the morning and gets it back at night?", "a": "A pillow" },
  { "q": "What kind of band never plays music?", "a": "A rubber band" },
  { "q": "What is tall when young and short when old?", "a": "A candle" },
  { "q": "What do you find at the end of a rainbow?", "a": "The letter W" },
  { "q": "Why did the teddy bear say no to dessert?", "a": "Because she was already stuffed" },
  { "q": "What is black when you buy it, red when you use it, and gray when you throw it away?", "a": "Charcoal" }
]
