[
  { "q": "What has to be broken before you can use it?", "a": "An egg" },
  { "q": "I'm tall when I'm young, and I'm short when I'm old. What am I?", "a": "A candle" },
  { "q": "What month of the year has 28 days?", "a": "All of them" },
  { "q": "What is full of holes but still holds water?", "a": "A sponge" },
  { "q": "What question can you never answer yes to?", "a": "Are you asleep yet?" },
  { "q": "What gets wet while drying?", "a": "A towel" },
  { "q": "What can you keep after giving to someone?", "a": "Your word" },
  { "q": "I have branches, but no fruit, trunk or leaves. What am I?", "a": "A bank" },
  { "q": "The more of this there is, the less you see. What is it?", "a": "Darkness" },
  { "q": "What has many keys but can't open a single lock?", "a": "A piano" },
  { "q": "Where does today come before yesterday?", "a": "The dictionary" },
  { "q": "What has a head and a tail but no body?", "a": "A coin" },
  { "q": "What has a neck but no head?", "a": "A bottle" },
  { "q": "What goes up but never comes down?", "a": "Your age" },
  { "q": "What belongs to you, but other people use it more than you?", "a": "Your name" },
  { "q": "What has hands but cannot clap?", "a": "A clock" },
  { "q": "What has legs but cannot walk?", "a": "A table" },
  { "q": "What has one eye but cannot see?", "a": "A needle" },
  { "q": "What can travel around the world while staying in a corner?", "a": "A stamp" },
  { "q": "What begins with T, ends with T, and has T in it?", "a": "A teapot" },
  { "q": "What kind of room has no doors or windows?", "a": "A mushroom" },
  { "q": "What comes once in a minute, twice in a moment, but never in a thousand years?", "a": "The letter M" },
  { "q": "Which letter of the alphabet has the most water?", "a": "The C (sea)" },
  { "q": "What starts with a P, ends with an E, and has thousands of letters?", "a": "The post office" },
  { "q": "What begins with an E but only has one letter?", "a": "An envelope" },
  { "q": "I am an odd number. Take away a letter and I become even. What number am I?", "a": "Seven" },
  { "q": "If you drop me I'm sure to crack, but give me a smile and I'll always smile back. What am I?", "a": "A mirror" },
  { "q": "The more you take, the more you leave behind. What are they?", "a": "Footsteps" },
  { "q": "What turns everything around but does not move?", "a": "A mirror" },
  { "q": "What can you catch but not throw?", "a": "A cold" },
  { "q": "What has teeth but cannot bite?", "a": "A comb" },
  { "q": "What has words but never speaks?", "a": "A book" },
  { "q": "What runs but never walks, has a mouth but never talks?", "a": "A river" },
  { "q": "What can fill a room but takes up no space?", "a": "Light" },
  { "q": "What has four wheels and flies?", "a": "A garbage truck" },
  { "q": "What gets bigger the more you take away?", "a": "A hole" },
  { "q": "What comes down but never goes up?", "a": "Rain" },
  { "q": "What has a bottom at the top?", "a": "Your legs" },
  { "q": "What can run but never walks, has a bed but never sleeps?", "a": "A river" },
  { "q": "What has an eye but cannot see?", "a": "A hurricane" },
  { "q": "What has cities but no houses, forests but no trees, and water but no fish?", "a": "A map" },
  { "q": "I have no life, but I can die. What am I?", "a": "A battery" },
  { "q": "What can you hold in your right hand but never in your left?", "a": "Your left hand" },
  { "q": "What gets sharper the more you use it?", "a": "Your brain" },
  { "q": "What has ears but cannot hear?", "a": "A cornfield" },
  { "q": "I'm not alive, but I grow; I don't have lungs, but I need air. What am I?", "a": "Fire" },
  { "q": "What invention lets you look right through a wall?", "a": "A window" },
  { "q": "What can be cracked, made, told, and played?", "a": "A joke" },
  { "q": "What has a ring but no finger?", "a": "A telephone" },
  { "q": "I shave every day, but my beard stays the same. Who am I?", "a": "A barber" },
  { "q": "What two things can you never eat for breakfast?", "a": "Lunch and dinner" },
  { "q": "What word in the English language does the following: the first two letters signify a male, the first three letters signify a female, the first four letters signify a great, while the entire word signifies a great woman?", "a": "Heroine" },
  { "q": "What disappears as soon as you say its name?", "a": "Silence" },
  { "q": "You see me once in June, twice in November, and not at all in May. What am I?", "a": "The letter E" },
  { "q": "A girl fell off a 30-foot ladder but didn't get hurt. Why?", "a": "She fell off the bottom step" },
  { "q": "What word is spelled wrong in every dictionary?", "a": "Wrong" },
  { "q": "What five-letter word becomes shorter when you add two letters to it?", "a": "Short" },
  { "q": "How many letters are in the alphabet?", "a": "Eleven (T-H-E A-L-P-H-A-B-E-T)" },
  { "q": "What has 13 hearts but no other organs?", "a": "A deck of cards" },
  { "q": "What building has the most stories?", "a": "A library" },
  { "q": "What can you break even if you never pick it up or touch it?", "a": "A promise" },
  { "q": "A man who was outside in the rain without an umbrella or hat didn't get a single hair on his head wet. Why?", "a": "He was bald" },
  { "q": "What is seen in the middle of March and April that can't be seen at the beginning or end of either month?", "a": "The letter R" },
  { "q": "What goes through cities and fields, but never moves?", "a": "A road" },
  { "q": "I am always hungry and will die if not fed, but whatever I touch will soon turn red. What am I?", "a": "Fire" },
  { "q": "What can you hold in your left hand but not in your right?", "a": "Your right elbow" },
  { "q": "What is 3/7 chicken, 2/3 cat, and 2/4 goat?", "a": "Chicago" },
  { "q": "What is cut on a table, but is never eaten?", "a": "A deck of cards" },
  { "q": "What word contains 26 letters but only has three syllables?", "a": "Alphabet" },
  { "q": "Where do you find roads without cars, forests without trees, and cities without houses?", "a": "On a map" },
  { "q": "I am not alive, but I grow. I don't have lungs, but I need air. I don't have a mouth, but water kills me. What am I?", "a": "Fire" },
  { "q": "What is harder to catch the faster you run?", "a": "Your breath" },
  { "q": "What word starts with E and ends with E but only has one letter in it?", "a": "Envelope" },
  { "q": "What is so fragile that saying its name breaks it?", "a": "Silence" },
  { "q": "What is always in front of you but can't be seen?", "a": "The future" },
  { "q": "What kind of coat is best put on wet?", "a": "A coat of paint" },
  { "q": "If you have me, you want to share me. If you share me, you don't have me. What am I?", "a": "A secret" },
  { "q": "What tastes better than it smells?", "a": "Your tongue" },
  { "q": "What has a thumb and four fingers but is not alive?", "a": "A glove" },
  { "q": "The person who makes it sells it. The person who buys it never uses it. The person who uses it never knows they're using it. What is it?", "a": "A coffin" },
  { "q": "What can you put in a bucket to make it weigh less?", "a": "A hole" },
  { "q": "What do you throw out when you want to use it but take in when you don't want to use it?", "a": "An anchor" },
  { "q": "What bow can't be tied?", "a": "A rainbow" },
  { "q": "What type of cheese is made backward?", "a": "Edam" },
  { "q": "A bus driver goes the wrong way on a one-way street. He passes the cops, but they don't stop him. Why?", "a": "He was walking" },
  { "q": "What has one head, one foot, and four legs?", "a": "A bed" },
  { "q": "What can you serve but never eat?", "a": "A volleyball (or tennis ball)" },
  { "q": "What can't talk but will reply when spoken to?", "a": "An echo" },
  { "q": "What has a face and two hands but no arms or legs?", "a": "A clock" },
  { "q": "What always goes to bed with its shoes on?", "a": "A horse" },
  { "q": "What do you buy to eat but never consume?", "a": "Plates and utensils" },
  { "q": "What flies without wings?", "a": "Time" },
  { "q": "What side of a cat has the most fur?", "a": "The outside" },
  { "q": "What do you call a bear with no teeth?", "a": "A gummy bear" },
  { "q": "What has a spine but no bones?", "a": "A book" },
  { "q": "What is orange and sounds like a parrot?", "a": "A carrot" },
  { "q": "What do you call a fish without eyes?", "a": "A fsh" },
  { "q": "What stays where it is when it goes off?", "a": "An alarm clock" },
  { "q": "What kind of tree can you carry in your hand?", "a": "A palm" },
  { "q": "What has four eyes but cannot see?", "a": "Mississippi" },
  { "q": "What's black when you get it, red when you use it, and white when you're done with it?", "a": "Charcoal" },
  { "q": "I speak without a mouth and hear without ears. I have no body, but I come alive with the wind. What am I?", "a": "An echo" },
  { "q": "What word becomes shorter when you add two letters to it?", "a": "Short" },
  { "q": "What is always on its way but never arrives?", "a": "Tomorrow" },
  { "q": "I can be long or short, grown or bought, painted or left bare, round or square. What am I?", "a": "Fingernails" },
  { "q": "What breaks yet never falls, and what falls yet never breaks?", "a": "Day and night" },
  { "q": "Poor people have it, rich people need it, and if you eat it, you'll die. What is it?", "a": "Nothing" },
  { "q": "What goes around and around the wood but never goes into the wood?", "a": "The bark of a tree" },
  { "q": "What can run but never walks, has a mouth but never talks, has a head but never weeps, has a bed but never sleeps?", "a": "A river" },
  { "q": "I have keys but no locks. I have space but no room. You can enter but can't go inside. What am I?", "a": "A keyboard" },
  { "q": "What has a head, a tail, is brown, and has no legs?", "a": "A penny" },
  { "q": "What can you catch but never throw?", "a": "A cold" },
  { "q": "David's parents have three sons: Snap, Crackle, and what's the name of the third son?", "a": "David" },
  { "q": "What is at the end of a rainbow?", "a": "The letter W" },
  { "q": "What kind of band never plays music?", "a": "A rubber band" },
  { "q": "What has no beginning, end, or middle?", "a": "A doughnut" },
  { "q": "What do you call a sleeping dinosaur?", "a": "A dino-snore" },
  { "q": "What kind of cup doesn't hold water?", "a": "A cupcake" },
  { "q": "What room do ghosts avoid?", "a": "The living room" },
  { "q": "What do you call a boomerang that doesn't come back?", "a": "A stick" },
  { "q": "What word looks the same upside down and backward?", "a": "SWIMS" },
  { "q": "What rock group has four men that don't sing?", "a": "Mount Rushmore" },
  { "q": "What kind of ship has two mates but no captain?", "a": "A relationship" },
  { "q": "What do Alexander the Great and Winnie the Pooh have in common?", "a": "The same middle name" },
  { "q": "Why is the letter A like a flower?", "a": "Because a B (bee) comes after it" },
  { "q": "A cowboy rode into town on Friday. He stayed three days, then rode out on Friday. How?", "a": "Friday was the horse's name" },
  { "q": "What has many needles but doesn't sew?", "a": "A Christmas tree" },
  { "q": "What has a lot of words but never speaks?", "a": "A book" },
  { "q": "What kind of tree fits in your hand?", "a": "A palm tree" },
  { "q": "What can you hold without touching it?", "a": "A conversation" },
  { "q": "What runs around a house but doesn't move?", "a": "A fence" },
  { "q": "What has holes all over but still holds water?", "a": "A sponge" },
  { "q": "I have a head and a tail but no body. What am I?", "a": "A coin" },
  { "q": "What can go up a chimney down but can't go down a chimney up?", "a": "An umbrella" },
  { "q": "What loses its head in the morning and gets it back at night?", "a": "A pillow" },
  { "q": "What is deaf, dumb, and blind but always tells the truth?", "a": "A mirror" },
  { "q": "What belongs to you but is used more by others?", "a": "Your name" },
  { "q": "I go all around the world but never leave the corner. What am I?", "a": "A stamp" },
  { "q": "What has a bank but no money?", "a": "A river" },
  { "q": "What building has the most floors?", "a": "A library" },
  { "q": "What do you fill with empty hands?", "a": "Gloves" },
  { "q": "What kind of vegetable is angry?", "a": "A steamed carrot" },
  { "q": "What is easy to get into but hard to get out of?", "a": "Trouble" },
  { "q": "What falls but never gets hurt?", "a": "Rain" },
  { "q": "What can you not keep until you give it?", "a": "A promise" },
  { "q": "What goes up and down but doesn't move?", "a": "Stairs" },
  { "q": "What starts with a T, is full of T, and ends with T?", "a": "A teapot" },
  { "q": "What can be stolen, mistaken, or altered, yet never leaves you your entire life?", "a": "Your identity" },
  { "q": "What is heavy forward but backward is not?", "a": "The word 'ton'" },
  { "q": "What can point in every direction but can't reach the destination by itself?", "a": "Your finger" },
  { "q": "What common English word has three consecutive double letters?", "a": "Bookkeeper" },
  { "q": "Without a bridle or a saddle, across a thing I ride a-straddle. What am I?", "a": "Glasses on a nose" },
  { "q": "What seven-letter word becomes longer when the third letter is removed?", "a": "Lounger (becomes Longer)" },
  { "q": "What time does a tennis player get up?", "a": "Ten-ish" },
  { "q": "What do you get when you cross a snowman and a vampire?", "a": "Frostbite" },
  { "q": "What do you call a fairy that doesn't take a bath?", "a": "Stinkerbell" },
  { "q": "Why did the student eat his homework?", "a": "Because the teacher told him it was a piece of cake" },
  { "q": "What musical instrument is found in the bathroom?", "a": "A tuba toothpaste" },
  { "q": "What do you call a sleeping bull?", "a": "A bulldozer" },
  { "q": "What is it that after you take away the whole, some still remains?", "a": "Wholesome" },
  { "q": "A father and son were in a car accident. The father died. The son was rushed to the hospital. The surgeon said, 'I can't operate on him. He's my son.' How?", "a": "The surgeon is his mother" },
  { "q": "What has wheels and flies but is not an aircraft?", "a": "A garbage truck" },
  { "q": "What has a tongue but cannot taste?", "a": "A shoe" },
  { "q": "What do the letter 't' and an island have in common?", "a": "They're both in the middle of water" },
  { "q": "What can be measured but has no length, width, or height?", "a": "Temperature" },
  { "q": "What grows when it eats but dies when it drinks?", "a": "Fire" },
  { "q": "What is put on a table and cut but never eaten?", "a": "A deck of cards" },
  { "q": "What has 88 keys but can't open a single door?", "a": "A piano" },
  { "q": "What room can no one enter?", "a": "A mushroom" },
  { "q": "What word in the English language is always spelled incorrectly?", "a": "Incorrectly" },
  { "q": "What gets broken without being held?", "a": "A promise" },
  { "q": "What is full of holes but can still carry water?", "a": "A sponge" },
  { "q": "What can clap without hands?", "a": "Thunder" },
  { "q": "What moves without seeing and cries without eyes?", "a": "A cloud" },
  { "q": "What do you bury when it's alive and dig up when it's dead?", "a": "A plant" },
  { "q": "What asks but never answers?", "a": "An owl" },
  { "q": "What is born every minute, yet is never old?", "a": "Time" },
  { "q": "What is bought by the yard but worn by the foot?", "a": "Carpet" },
  { "q": "What stands on one leg with its heart in its head?", "a": "A cabbage" },
  { "q": "What dances without feet?", "a": "Flames" },
  { "q": "What sits on the floor but can't be moved?", "a": "A shadow" },
  { "q": "What sleeps with shoes on?", "a": "A horse" },
  { "q": "What keeps going up but never moves?", "a": "Your age" },
  { "q": "What swims in water but never gets wet?", "a": "A shadow" },
  { "q": "What crosses the river without moving?", "a": "A bridge" },
  { "q": "What do you call a cat that loves to bowl?", "a": "An alley cat" },
  { "q": "What goes through a door but never comes in or goes out?", "a": "A keyhole" },
  { "q": "What food is never on time?", "a": "Choco-late" },
  { "q": "What has an eye but cannot see?", "a": "A potato" },
  { "q": "What can't be used until it's broken?", "a": "An egg" }
]
